#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
#### Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.
#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
#### Q7. Create a DataFrame using multiple Series. Explain with an example.

## Answers

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
import pandas as pd
ps=pd.Series([4,8,15,16,23,42])

In [7]:
ps

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
type(ps)

pandas.core.series.Series

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [9]:
l=[1,2,3,4,5,6,7,8,9,10]
ps1=pd.Series(l)
ps1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
d={"Name":["Alics","Bob","Claire"],
   "Age":[25,30,27],
   "Gender":["Female","Male","Female"]
  }
df=pd.DataFrame(d)
df

     Name  Age  Gender
0   Alics   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.¶

#### DataFrame :

'DataFrame' is a two-dimensional data structure that represents tabular data, similar to a spreadsheet or a SQL table. It is one of the core data structures provided by the pandas library and is particularly useful for data manipulation, analysis, and cleaning. A DataFrame consists of rows and columns, where each column can hold data of a different type (e.g., integers, floats, strings, etc.).

#### series :

'pandas.Series' is a one-dimensional array-like object that can hold a variety of data types, similar to a Python list or a NumPy array. It is a fundamental data structure in pandas and can be considered as a single column of data with a labeled index. A Series can be thought of as a single column of a DataFrame.

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?¶

#### 1. df.head(n) : 
Returns the first 'n' rows of the DataFrame. Useful for quickly inspecting the initial data.

In [11]:
df.head(2)

    Name  Age  Gender
0  Alics   25  Female
1    Bob   30    Male

#### 2. df.head(n) :
Returns the first 'n' rows of the DataFrame. Useful for quickly inspecting the initial data.

In [12]:
df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

#### 3. df.info() : 
Provides a concise summary of the DataFrame, including the data types and non-null values in each column. Useful for data inspection and identifying missing values.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

#### 4. df.describe() :
Generates descriptive statistics of the numerical columns in the DataFrame, such as count, mean, standard deviation, minimum, and maximum. Useful for getting a quick overview of the data distribution.
python

In [14]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

#### 5. df.sort_values(by=) : 
Sorts the DataFrame based on the values in one or more columns. Useful for arranging data in a specific order.

In [16]:
df.sort_values(by="Age")

     Name  Age  Gender
0   Alics   25  Female
2  Claire   27  Female
1     Bob   30    Male

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

1. Series :
---------------
A Series in pandas is a one-dimensional array-like object and is immutable. Once a Series is created, you cannot modify its elements directly. Instead, you need to create a new Series if you want to make changes to the data.

2. DataFrame :
-------------------
A DataFrame in pandas is a two-dimensional tabular data structure, and it is mutable. You can add or remove columns, modify existing data, or perform various data manipulation operations on a DataFrame without creating a new DataFrame each time.

3. Panel : 
--------------
In earlier versions of pandas, there was a data structure called 'Panel,' which represented three-dimensional data. However, it was deprecated and removed in later versions. As of pandas 1.0.0, 'Panel' is no longer available in pandas, and users are encouraged to use 'DataFrame' or 'MultiIndex DataFrame' for more complex data representation.

Note : Only DataFrame is mutable

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [17]:
ps2=pd.Series([10,20,30,40])
ps3=pd.Series(["A","B","C","D"])

In [18]:
ps2

0    10
1    20
2    30
3    40
dtype: int64

In [19]:
ps3

0    A
1    B
2    C
3    D
dtype: object

In [24]:
df3=pd.DataFrame({"Roll_No":ps2,"Name":ps3})

In [25]:
df3

   Roll_No Name
0       10    A
1       20    B
2       30    C
3       40    D

1. Each Series will form a column of the DataFrame, and they should have the same length to align properly.

2. create a simple example where we have two Series, one representing the names of students and another representing their corresponding roll numbers. We'll then combine these Series into a DataFrame: